// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.

int a = 13;
int b = 2;

while (b < a)
{
    Console.WriteLine(b);
    b+=2;
}